{"id":"a0fd2bb0-b609-11ec-a584-5d63d57d548c","updated_at":"2022-04-07T00:34:12.346Z","updated_by":"sam-adm","created_at":"2022-04-07T00:28:22.144Z","created_by":"sam-adm","name":"Abnormal Remote Thread Creation","tags":["cobalt strike","remote thread"],"interval":"5m","enabled":true,"description":"This alert is possibly associated with Cobalt Strike process injection. Further Investigation into this is needed for a full description. \n\\n\nSee the following:\n\\n\nhttps://docs.microsoft.com/en-us/windows/win32/api/processthreadsapi/nf-processthreadsapi-createremotethread\n\\n\nhttps://resources.infosecinstitute.com/topic/using-createremotethread-for-dll-injection-on-windows/","risk_score":73,"severity":"high","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://zappa.sbc:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"54c50b2b-bcb1-4ce2-861d-59c13651fc78","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":3,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["filebeat-*","logs-*","packetbeat-*","winlogbeat-*"],"query":"event.code: 8 and not winlog.event_data.StartModule: \"C:\\\\Windows\\\\System32\\\\KERNELBASE.dll\"","filters":[],"throttle":"no_actions","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
