{"id":"c86dc940-bf80-11ec-b3b8-0363ca5e87f3","updated_at":"2022-04-19T01:43:49.652Z","updated_by":"sam-adm","created_at":"2022-04-19T01:33:58.308Z","created_by":"sam-adm","name":"Windows Defender Real Time Monitoring Disabled","tags":["windows","antivirus"],"interval":"5m","enabled":true,"description":"When a user disables Windows Defender via the GUI, this registry key is modified. \n\nSysmon also has the ability to pair events to the MITRE framework, this one being T1089, being related to T1562\n\n[https://attack.mitre.org/techniques/T1562/001/]","risk_score":73,"severity":"high","license":"","output_index":".siem-signals-default","meta":{"from":"1m","kibana_siem_app_url":"https://zappa.sbc:5601/app/security"},"author":[],"false_positives":[],"from":"now-360s","rule_id":"2eaee60f-ac71-4390-a92e-85bb1a992464","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[],"to":"now","references":[],"version":6,"exceptions_list":[],"immutable":false,"type":"query","language":"kuery","index":["apm-*-transaction*","traces-apm*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","winlogbeat-*"],"query":"registry.path: \"HKLM\\SOFTWARE\\Microsoft\\Windows Defender\\Real-Time Protection\\DisableRealtimeMonitoring\" OR rule.name: \"T1089,Tamper-Defender\"","filters":[],"throttle":"no_actions","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0}
